Ran Plan for dir: `aws/dev/vpc` workspace: `default`

<details><summary>Show Output</summary>

```diff
22:51:40.319 INFO   Downloading Terraform configurations from ../../../modules/vpc into ./.terragrunt-cache/skUz3zUeGse1ktDhId0bvOHY5qA/q2s4-ARxwF87guDVMAAmBOR8h7Y
22:51:41.116 STDOUT terraform: Initializing the backend...
22:51:41.739 STDOUT terraform: Successfully configured the backend "s3"! Terraform will automatically
22:51:41.739 STDOUT terraform: use this backend unless the backend configuration changes.
22:51:41.894 STDOUT terraform: Initializing modules...
22:51:41.912 STDOUT terraform: Downloading registry.terraform.io/terraform-aws-modules/vpc/aws 5.13.0 for vpc...
22:51:42.249 STDOUT terraform: - vpc in .terraform/modules/vpc
22:51:42.252 STDOUT terraform: Initializing provider plugins...
22:51:42.252 STDOUT terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
22:51:42.284 STDOUT terraform: - Installing hashicorp/aws v5.69.0...
22:51:52.375 STDOUT terraform: - Installed hashicorp/aws v5.69.0 (signed by HashiCorp)
22:51:52.375 STDOUT terraform: Terraform has made some changes to the provider dependency selections recorded
22:51:52.375 STDOUT terraform: in the .terraform.lock.hcl file. Review those changes and commit them to your
22:51:52.375 STDOUT terraform: version control system if they represent changes you intended to make.
22:51:52.375 STDOUT terraform: Terraform has been successfully initialized!
22:51:52.376 STDOUT terraform: You may now begin working with Terraform. Try running "terraform plan" to see
22:51:52.376 STDOUT terraform: any changes that are required for your infrastructure. All Terraform commands
22:51:52.376 STDOUT terraform: should now work.
22:51:52.376 STDOUT terraform: If you ever set or change modules or backend configuration for Terraform,
22:51:52.376 STDOUT terraform: rerun this command to reinitialize your working directory. If you forget, other
22:51:52.376 STDOUT terraform: commands will detect it and remind you to do so if necessary.
22:51:57.124 STDOUT terraform: data.aws_availability_zones.available: Reading...
22:51:57.449 STDOUT terraform: data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
22:51:57.697 STDOUT terraform: Terraform used the selected providers to generate the following execution
22:51:57.697 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
22:51:57.697 STDOUT terraform:   + create
22:51:57.697 STDOUT terraform: Terraform will perform the following actions:
22:51:57.697 STDOUT terraform:   # module.vpc.aws_default_network_acl.this[0] will be created
22:51:57.697 STDOUT terraform:   + resource "aws_default_network_acl" "this" {
22:51:57.698 STDOUT terraform:       + arn                    = (known after apply)
22:51:57.698 STDOUT terraform:       + default_network_acl_id = (known after apply)
22:51:57.698 STDOUT terraform:       + id                     = (known after apply)
22:51:57.698 STDOUT terraform:       + owner_id               = (known after apply)
22:51:57.698 STDOUT terraform:       + tags                   = {
22:51:57.698 STDOUT terraform:           + "Name" = "dev-vpc-default"
22:51:57.698 STDOUT terraform:         }
22:51:57.698 STDOUT terraform:       + tags_all               = {
22:51:57.698 STDOUT terraform:           + "Name" = "dev-vpc-default"
22:51:57.698 STDOUT terraform:         }
22:51:57.698 STDOUT terraform:       + vpc_id                 = (known after apply)
22:51:57.698 STDOUT terraform:       + egress {
22:51:57.698 STDOUT terraform:           + action          = "allow"
22:51:57.698 STDOUT terraform:           + from_port       = 0
22:51:57.698 STDOUT terraform:           + ipv6_cidr_block = "::/0"
22:51:57.698 STDOUT terraform:           + protocol        = "-1"
22:51:57.698 STDOUT terraform:           + rule_no         = 101
22:51:57.698 STDOUT terraform:           + to_port         = 0
22:51:57.698 STDOUT terraform:             # (1 unchanged attribute hidden)
22:51:57.698 STDOUT terraform:         }
22:51:57.698 STDOUT terraform:       + egress {
22:51:57.698 STDOUT terraform:           + action          = "allow"
22:51:57.698 STDOUT terraform:           + cidr_block      = "0.0.0.0/0"
22:51:57.699 STDOUT terraform:           + from_port       = 0
22:51:57.699 STDOUT terraform:           + protocol        = "-1"
22:51:57.699 STDOUT terraform:           + rule_no         = 100
22:51:57.699 STDOUT terraform:           + to_port         = 0
22:51:57.699 STDOUT terraform:             # (1 unchanged attribute hidden)
22:51:57.699 STDOUT terraform:         }
22:51:57.699 STDOUT terraform:       + ingress {
22:51:57.699 STDOUT terraform:           + action          = "allow"
22:51:57.699 STDOUT terraform:           + from_port       = 0
22:51:57.699 STDOUT terraform:           + ipv6_cidr_block = "::/0"
22:51:57.699 STDOUT terraform:           + protocol        = "-1"
22:51:57.699 STDOUT terraform:           + rule_no         = 101
22:51:57.699 STDOUT terraform:           + to_port         = 0
22:51:57.699 STDOUT terraform:             # (1 unchanged attribute hidden)
22:51:57.699 STDOUT terraform:         }
22:51:57.699 STDOUT terraform:       + ingress {
22:51:57.699 STDOUT terraform:           + action          = "allow"
22:51:57.699 STDOUT terraform:           + cidr_block      = "0.0.0.0/0"
22:51:57.699 STDOUT terraform:           + from_port       = 0
22:51:57.699 STDOUT terraform:           + protocol        = "-1"
22:51:57.699 STDOUT terraform:           + rule_no         = 100
22:51:57.699 STDOUT terraform:           + to_port         = 0
22:51:57.699 STDOUT terraform:             # (1 unchanged attribute hidden)
22:51:57.699 STDOUT terraform:         }
22:51:57.699 STDOUT terraform:     }
22:51:57.699 STDOUT terraform:   # module.vpc.aws_default_route_table.default[0] will be created
22:51:57.699 STDOUT terraform:   + resource "aws_default_route_table" "default" {
22:51:57.699 STDOUT terraform:       + arn                    = (known after apply)
22:51:57.699 STDOUT terraform:       + default_route_table_id = (known after apply)
22:51:57.699 STDOUT terraform:       + id                     = (known after apply)
22:51:57.699 STDOUT terraform:       + owner_id               = (known after apply)
22:51:57.699 STDOUT terraform:       + route                  = (known after apply)
22:51:57.699 STDOUT terraform:       + tags                   = {
22:51:57.699 STDOUT terraform:           + "Name" = "dev-vpc-default"
22:51:57.699 STDOUT terraform:         }
22:51:57.700 STDOUT terraform:       + tags_all               = {
22:51:57.700 STDOUT terraform:           + "Name" = "dev-vpc-default"
22:51:57.700 STDOUT terraform:         }
22:51:57.700 STDOUT terraform:       + vpc_id                 = (known after apply)
22:51:57.700 STDOUT terraform:       + timeouts {
22:51:57.700 STDOUT terraform:           + create = "5m"
22:51:57.700 STDOUT terraform:           + update = "5m"
22:51:57.700 STDOUT terraform:         }
22:51:57.700 STDOUT terraform:     }
22:51:57.700 STDOUT terraform:   # module.vpc.aws_default_security_group.this[0] will be created
22:51:57.700 STDOUT terraform:   + resource "aws_default_security_group" "this" {
22:51:57.700 STDOUT terraform:       + arn                    = (known after apply)
22:51:57.700 STDOUT terraform:       + description            = (known after apply)
22:51:57.700 STDOUT terraform:       + egress                 = (known after apply)
22:51:57.700 STDOUT terraform:       + id                     = (known after apply)
22:51:57.700 STDOUT terraform:       + ingress                = (known after apply)
22:51:57.700 STDOUT terraform:       + name                   = (known after apply)
22:51:57.701 STDOUT terraform:       + name_prefix            = (known after apply)
22:51:57.701 STDOUT terraform:       + owner_id               = (known after apply)
22:51:57.701 STDOUT terraform:       + revoke_rules_on_delete = false
22:51:57.701 STDOUT terraform:       + tags                   = {
22:51:57.701 STDOUT terraform:           + "Name" = "dev-vpc-default"
22:51:57.701 STDOUT terraform:         }
22:51:57.702 STDOUT terraform:       + tags_all               = {
22:51:57.702 STDOUT terraform:           + "Name" = "dev-vpc-default"
22:51:57.702 STDOUT terraform:         }
22:51:57.702 STDOUT terraform:       + vpc_id                 = (known after apply)
22:51:57.702 STDOUT terraform:     }
22:51:57.702 STDOUT terraform:   # module.vpc.aws_eip.nat[0] will be created
22:51:57.702 STDOUT terraform:   + resource "aws_eip" "nat" {
22:51:57.702 STDOUT terraform:       + allocation_id        = (known after apply)
22:51:57.702 STDOUT terraform:       + arn                  = (known after apply)
22:51:57.702 STDOUT terraform:       + association_id       = (known after apply)
22:51:57.702 STDOUT terraform:       + carrier_ip           = (known after apply)
22:51:57.702 STDOUT terraform:       + customer_owned_ip    = (known after apply)
22:51:57.702 STDOUT terraform:       + domain               = "vpc"
22:51:57.702 STDOUT terraform:       + id                   = (known after apply)
22:51:57.702 STDOUT terraform:       + instance             = (known after apply)
22:51:57.702 STDOUT terraform:       + network_border_group = (known after apply)
22:51:57.702 STDOUT terraform:       + network_interface    = (known after apply)
22:51:57.702 STDOUT terraform:       + private_dns          = (known after apply)
22:51:57.702 STDOUT terraform:       + private_ip           = (known after apply)
22:51:57.702 STDOUT terraform:       + ptr_record           = (known after apply)
22:51:57.702 STDOUT terraform:       + public_dns           = (known after apply)
22:51:57.702 STDOUT terraform:       + public_ip            = (known after apply)
22:51:57.702 STDOUT terraform:       + public_ipv4_pool     = (known after apply)
22:51:57.702 STDOUT terraform:       + tags                 = {
22:51:57.702 STDOUT terraform:           + "Name" = "dev-vpc-eu-west-1a"
22:51:57.702 STDOUT terraform:         }
22:51:57.702 STDOUT terraform:       + tags_all             = {
22:51:57.702 STDOUT terraform:           + "Name" = "dev-vpc-eu-west-1a"
22:51:57.702 STDOUT terraform:         }
22:51:57.702 STDOUT terraform:       + vpc                  = (known after apply)
22:51:57.702 STDOUT terraform:     }
22:51:57.702 STDOUT terraform:   # module.vpc.aws_internet_gateway.this[0] will be created
22:51:57.702 STDOUT terraform:   + resource "aws_internet_gateway" "this" {
22:51:57.703 STDOUT terraform:       + arn      = (known after apply)
22:51:57.703 STDOUT terraform:       + id       = (known after apply)
22:51:57.703 STDOUT terraform:       + owner_id = (known after apply)
22:51:57.703 STDOUT terraform:       + tags     = {
22:51:57.703 STDOUT terraform:           + "Name" = "dev-vpc"
22:51:57.703 STDOUT terraform:         }
22:51:57.703 STDOUT terraform:       + tags_all = {
22:51:57.703 STDOUT terraform:           + "Name" = "dev-vpc"
22:51:57.703 STDOUT terraform:         }
22:51:57.703 STDOUT terraform:       + vpc_id   = (known after apply)
22:51:57.703 STDOUT terraform:     }
22:51:57.703 STDOUT terraform:   # module.vpc.aws_nat_gateway.this[0] will be created
22:51:57.703 STDOUT terraform:   + resource "aws_nat_gateway" "this" {
22:51:57.703 STDOUT terraform:       + allocation_id                      = (known after apply)
22:51:57.703 STDOUT terraform:       + association_id                     = (known after apply)
22:51:57.703 STDOUT terraform:       + connectivity_type                  = "public"
22:51:57.703 STDOUT terraform:       + id                                 = (known after apply)
22:51:57.703 STDOUT terraform:       + network_interface_id               = (known after apply)
22:51:57.703 STDOUT terraform:       + private_ip                         = (known after apply)
22:51:57.703 STDOUT terraform:       + public_ip                          = (known after apply)
22:51:57.703 STDOUT terraform:       + secondary_private_ip_address_count = (known after apply)
22:51:57.703 STDOUT terraform:       + secondary_private_ip_addresses     = (known after apply)
22:51:57.703 STDOUT terraform:       + subnet_id                          = (known after apply)
22:51:57.703 STDOUT terraform:       + tags                               = {
22:51:57.703 STDOUT terraform:           + "Name" = "dev-vpc-eu-west-1a"
22:51:57.703 STDOUT terraform:         }
22:51:57.703 STDOUT terraform:       + tags_all                           = {
22:51:57.703 STDOUT terraform:           + "Name" = "dev-vpc-eu-west-1a"
22:51:57.703 STDOUT terraform:         }
22:51:57.703 STDOUT terraform:     }
22:51:57.704 STDOUT terraform:   # module.vpc.aws_route.private_nat_gateway[0] will be created
22:51:57.704 STDOUT terraform:   + resource "aws_route" "private_nat_gateway" {
22:51:57.704 STDOUT terraform:       + destination_cidr_block = "0.0.0.0/0"
22:51:57.704 STDOUT terraform:       + id                     = (known after apply)
22:51:57.704 STDOUT terraform:       + instance_id            = (known after apply)
22:51:57.704 STDOUT terraform:       + instance_owner_id      = (known after apply)
22:51:57.704 STDOUT terraform:       + nat_gateway_id         = (known after apply)
22:51:57.704 STDOUT terraform:       + network_interface_id   = (known after apply)
22:51:57.704 STDOUT terraform:       + origin                 = (known after apply)
22:51:57.704 STDOUT terraform:       + route_table_id         = (known after apply)
22:51:57.704 STDOUT terraform:       + state                  = (known after apply)
22:51:57.704 STDOUT terraform:       + timeouts {
22:51:57.704 STDOUT terraform:           + create = "5m"
22:51:57.704 STDOUT terraform:         }
22:51:57.704 STDOUT terraform:     }
22:51:57.704 STDOUT terraform:   # module.vpc.aws_route.public_internet_gateway[0] will be created
22:51:57.704 STDOUT terraform:   + resource "aws_route" "public_internet_gateway" {
22:51:57.704 STDOUT terraform:       + destination_cidr_block = "0.0.0.0/0"
22:51:57.704 STDOUT terraform:       + gateway_id             = (known after apply)
22:51:57.704 STDOUT terraform:       + id                     = (known after apply)
22:51:57.704 STDOUT terraform:       + instance_id            = (known after apply)
22:51:57.704 STDOUT terraform:       + instance_owner_id      = (known after apply)
22:51:57.704 STDOUT terraform:       + network_interface_id   = (known after apply)
22:51:57.704 STDOUT terraform:       + origin                 = (known after apply)
22:51:57.704 STDOUT terraform:       + route_table_id         = (known after apply)
22:51:57.704 STDOUT terraform:       + state                  = (known after apply)
22:51:57.704 STDOUT terraform:       + timeouts {
22:51:57.704 STDOUT terraform:           + create = "5m"
22:51:57.704 STDOUT terraform:         }
22:51:57.704 STDOUT terraform:     }
22:51:57.704 STDOUT terraform:   # module.vpc.aws_route_table.private[0] will be created
22:51:57.704 STDOUT terraform:   + resource "aws_route_table" "private" {
22:51:57.704 STDOUT terraform:       + arn              = (known after apply)
22:51:57.705 STDOUT terraform:       + id               = (known after apply)
22:51:57.705 STDOUT terraform:       + owner_id         = (known after apply)
22:51:57.705 STDOUT terraform:       + propagating_vgws = (known after apply)
22:51:57.705 STDOUT terraform:       + route            = (known after apply)
22:51:57.705 STDOUT terraform:       + tags             = {
22:51:57.706 STDOUT terraform:           + "Name" = "dev-vpc-private"
22:51:57.706 STDOUT terraform:         }
22:51:57.706 STDOUT terraform:       + tags_all         = {
22:51:57.706 STDOUT terraform:           + "Name" = "dev-vpc-private"
22:51:57.706 STDOUT terraform:         }
22:51:57.706 STDOUT terraform:       + vpc_id           = (known after apply)
22:51:57.706 STDOUT terraform:     }
22:51:57.706 STDOUT terraform:   # module.vpc.aws_route_table.public[0] will be created
22:51:57.706 STDOUT terraform:   + resource "aws_route_table" "public" {
22:51:57.706 STDOUT terraform:       + arn              = (known after apply)
22:51:57.706 STDOUT terraform:       + id               = (known after apply)
22:51:57.706 STDOUT terraform:       + owner_id         = (known after apply)
22:51:57.706 STDOUT terraform:       + propagating_vgws = (known after apply)
22:51:57.706 STDOUT terraform:       + route            = (known after apply)
22:51:57.706 STDOUT terraform:       + tags             = {
22:51:57.706 STDOUT terraform:           + "Name" = "dev-vpc-public"
22:51:57.706 STDOUT terraform:         }
22:51:57.706 STDOUT terraform:       + tags_all         = {
22:51:57.706 STDOUT terraform:           + "Name" = "dev-vpc-public"
22:51:57.706 STDOUT terraform:         }
22:51:57.706 STDOUT terraform:       + vpc_id           = (known after apply)
22:51:57.706 STDOUT terraform:     }
22:51:57.707 STDOUT terraform:   # module.vpc.aws_route_table_association.private[0] will be created
22:51:57.707 STDOUT terraform:   + resource "aws_route_table_association" "private" {
22:51:57.707 STDOUT terraform:       + id             = (known after apply)
22:51:57.707 STDOUT terraform:       + route_table_id = (known after apply)
22:51:57.707 STDOUT terraform:       + subnet_id      = (known after apply)
22:51:57.707 STDOUT terraform:     }
22:51:57.707 STDOUT terraform:   # module.vpc.aws_route_table_association.private[1] will be created
22:51:57.707 STDOUT terraform:   + resource "aws_route_table_association" "private" {
22:51:57.707 STDOUT terraform:       + id             = (known after apply)
22:51:57.707 STDOUT terraform:       + route_table_id = (known after apply)
22:51:57.707 STDOUT terraform:       + subnet_id      = (known after apply)
22:51:57.707 STDOUT terraform:     }
22:51:57.707 STDOUT terraform:   # module.vpc.aws_route_table_association.public[0] will be created
22:51:57.707 STDOUT terraform:   + resource "aws_route_table_association" "public" {
22:51:57.707 STDOUT terraform:       + id             = (known after apply)
22:51:57.707 STDOUT terraform:       + route_table_id = (known after apply)
22:51:57.707 STDOUT terraform:       + subnet_id      = (known after apply)
22:51:57.707 STDOUT terraform:     }
22:51:57.707 STDOUT terraform:   # module.vpc.aws_route_table_association.public[1] will be created
22:51:57.707 STDOUT terraform:   + resource "aws_route_table_association" "public" {
22:51:57.707 STDOUT terraform:       + id             = (known after apply)
22:51:57.707 STDOUT terraform:       + route_table_id = (known after apply)
22:51:57.707 STDOUT terraform:       + subnet_id      = (known after apply)
22:51:57.707 STDOUT terraform:     }
22:51:57.707 STDOUT terraform:   # module.vpc.aws_subnet.private[0] will be created
22:51:57.708 STDOUT terraform:   + resource "aws_subnet" "private" {
22:51:57.708 STDOUT terraform:       + arn                                            = (known after apply)
22:51:57.708 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
22:51:57.708 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
22:51:57.708 STDOUT terraform:       + availability_zone_id                           = (known after apply)
22:51:57.708 STDOUT terraform:       + cidr_block                                     = "10.0.1.0/24"
22:51:57.708 STDOUT terraform:       + enable_dns64                                   = false
22:51:57.708 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
22:51:57.708 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
22:51:57.708 STDOUT terraform:       + id                                             = (known after apply)
22:51:57.708 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
22:51:57.708 STDOUT terraform:       + ipv6_native                                    = false
22:51:57.708 STDOUT terraform:       + map_public_ip_on_launch                        = false
22:51:57.708 STDOUT terraform:       + owner_id                                       = (known after apply)
22:51:57.708 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
22:51:57.708 STDOUT terraform:       + tags                                           = {
22:51:57.708 STDOUT terraform:           + "Name" = "dev-vpc-private-eu-west-1a"
22:51:57.708 STDOUT terraform:         }
22:51:57.708 STDOUT terraform:       + tags_all                                       = {
22:51:57.708 STDOUT terraform:           + "Name" = "dev-vpc-private-eu-west-1a"
22:51:57.709 STDOUT terraform:         }
22:51:57.709 STDOUT terraform:       + vpc_id                                         = (known after apply)
22:51:57.709 STDOUT terraform:     }
22:51:57.709 STDOUT terraform:   # module.vpc.aws_subnet.private[1] will be created
22:51:57.709 STDOUT terraform:   + resource "aws_subnet" "private" {
22:51:57.709 STDOUT terraform:       + arn                                            = (known after apply)
22:51:57.709 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
22:51:57.709 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
22:51:57.709 STDOUT terraform:       + availability_zone_id                           = (known after apply)
22:51:57.709 STDOUT terraform:       + cidr_block                                     = "10.0.2.0/24"
22:51:57.709 STDOUT terraform:       + enable_dns64                                   = false
22:51:57.709 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
22:51:57.709 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
22:51:57.709 STDOUT terraform:       + id                                             = (known after apply)
22:51:57.709 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
22:51:57.709 STDOUT terraform:       + ipv6_native                                    = false
22:51:57.709 STDOUT terraform:       + map_public_ip_on_launch                        = false
22:51:57.709 STDOUT terraform:       + owner_id                                       = (known after apply)
22:51:57.709 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
22:51:57.709 STDOUT terraform:       + tags                                           = {
22:51:57.709 STDOUT terraform:           + "Name" = "dev-vpc-private-eu-west-1b"
22:51:57.709 STDOUT terraform:         }
22:51:57.709 STDOUT terraform:       + tags_all                                       = {
22:51:57.710 STDOUT terraform:           + "Name" = "dev-vpc-private-eu-west-1b"
22:51:57.710 STDOUT terraform:         }
22:51:57.710 STDOUT terraform:       + vpc_id                                         = (known after apply)
22:51:57.710 STDOUT terraform:     }
22:51:57.710 STDOUT terraform:   # module.vpc.aws_subnet.public[0] will be created
22:51:57.710 STDOUT terraform:   + resource "aws_subnet" "public" {
22:51:57.710 STDOUT terraform:       + arn                                            = (known after apply)
22:51:57.710 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
22:51:57.710 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
22:51:57.710 STDOUT terraform:       + availability_zone_id                           = (known after apply)
22:51:57.710 STDOUT terraform:       + cidr_block                                     = "10.0.101.0/24"
22:51:57.710 STDOUT terraform:       + enable_dns64                                   = false
22:51:57.710 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
22:51:57.710 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
22:51:57.710 STDOUT terraform:       + id                                             = (known after apply)
22:51:57.710 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
22:51:57.710 STDOUT terraform:       + ipv6_native                                    = false
22:51:57.710 STDOUT terraform:       + map_public_ip_on_launch                        = false
22:51:57.710 STDOUT terraform:       + owner_id                                       = (known after apply)
22:51:57.710 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
22:51:57.710 STDOUT terraform:       + tags                                           = {
22:51:57.710 STDOUT terraform:           + "Name" = "dev-vpc-public-eu-west-1a"
22:51:57.710 STDOUT terraform:         }
22:51:57.710 STDOUT terraform:       + tags_all                                       = {
22:51:57.710 STDOUT terraform:           + "Name" = "dev-vpc-public-eu-west-1a"
22:51:57.710 STDOUT terraform:         }
22:51:57.710 STDOUT terraform:       + vpc_id                                         = (known after apply)
22:51:57.710 STDOUT terraform:     }
22:51:57.710 STDOUT terraform:   # module.vpc.aws_subnet.public[1] will be created
22:51:57.710 STDOUT terraform:   + resource "aws_subnet" "public" {
22:51:57.710 STDOUT terraform:       + arn                                            = (known after apply)
22:51:57.710 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
22:51:57.710 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
22:51:57.711 STDOUT terraform:       + availability_zone_id                           = (known after apply)
22:51:57.711 STDOUT terraform:       + cidr_block                                     = "10.0.102.0/24"
22:51:57.711 STDOUT terraform:       + enable_dns64                                   = false
22:51:57.711 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
22:51:57.711 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
22:51:57.711 STDOUT terraform:       + id                                             = (known after apply)
22:51:57.711 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
22:51:57.711 STDOUT terraform:       + ipv6_native                                    = false
22:51:57.711 STDOUT terraform:       + map_public_ip_on_launch                        = false
22:51:57.711 STDOUT terraform:       + owner_id                                       = (known after apply)
22:51:57.711 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
22:51:57.711 STDOUT terraform:       + tags                                           = {
22:51:57.711 STDOUT terraform:           + "Name" = "dev-vpc-public-eu-west-1b"
22:51:57.711 STDOUT terraform:         }
22:51:57.711 STDOUT terraform:       + tags_all                                       = {
22:51:57.711 STDOUT terraform:           + "Name" = "dev-vpc-public-eu-west-1b"
22:51:57.711 STDOUT terraform:         }
22:51:57.711 STDOUT terraform:       + vpc_id                                         = (known after apply)
22:51:57.711 STDOUT terraform:     }
22:51:57.711 STDOUT terraform:   # module.vpc.aws_vpc.this[0] will be created
22:51:57.711 STDOUT terraform:   + resource "aws_vpc" "this" {
22:51:57.711 STDOUT terraform:       + arn                                  = (known after apply)
22:51:57.711 STDOUT terraform:       + cidr_block                           = "10.0.0.0/16"
22:51:57.711 STDOUT terraform:       + default_network_acl_id               = (known after apply)
22:51:57.711 STDOUT terraform:       + default_route_table_id               = (known after apply)
22:51:57.711 STDOUT terraform:       + default_security_group_id            = (known after apply)
22:51:57.711 STDOUT terraform:       + dhcp_options_id                      = (known after apply)
22:51:57.711 STDOUT terraform:       + enable_dns_hostnames                 = true
22:51:57.711 STDOUT terraform:       + enable_dns_support                   = true
22:51:57.711 STDOUT terraform:       + enable_network_address_usage_metrics = (known after apply)
22:51:57.711 STDOUT terraform:       + id                                   = (known after apply)
22:51:57.711 STDOUT terraform:       + instance_tenancy                     = "default"
22:51:57.711 STDOUT terraform:       + ipv6_association_id                  = (known after apply)
22:51:57.711 STDOUT terraform:       + ipv6_cidr_block                      = (known after apply)
22:51:57.712 STDOUT terraform:       + ipv6_cidr_block_network_border_group = (known after apply)
22:51:57.712 STDOUT terraform:       + main_route_table_id                  = (known after apply)
22:51:57.712 STDOUT terraform:       + owner_id                             = (known after apply)
22:51:57.712 STDOUT terraform:       + tags                                 = {
22:51:57.712 STDOUT terraform:           + "Name" = "dev-vpc"
22:51:57.712 STDOUT terraform:         }
22:51:57.712 STDOUT terraform:       + tags_all                             = {
22:51:57.712 STDOUT terraform:           + "Name" = "dev-vpc"
22:51:57.712 STDOUT terraform:         }
22:51:57.712 STDOUT terraform:     }
22:51:57.712 STDOUT terraform: Plan: 19 to add, 0 to change, 0 to destroy.
22:51:57.712 STDOUT terraform: Changes to Outputs:
22:51:57.712 STDOUT terraform:   + private_subnets = [
22:51:57.712 STDOUT terraform:       + (known after apply),
22:51:57.712 STDOUT terraform:       + (known after apply),
22:51:57.712 STDOUT terraform:     ]
22:51:57.712 STDOUT terraform:   + public_subnets  = [
22:51:57.712 STDOUT terraform:       + (known after apply),
22:51:57.712 STDOUT terraform:       + (known after apply),
22:51:57.712 STDOUT terraform:     ]
22:51:57.712 STDOUT terraform:   + vpc_id          = (known after apply)
22:51:57.712 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
22:51:57.712 STDOUT terraform: Saved the plan to:
22:51:57.712 STDOUT terraform: ./default.tfplan
22:51:57.712 STDOUT terraform: To perform exactly these actions, run the following command to apply:
22:51:57.712 STDOUT terraform:     terraform apply "./default.tfplan"

22:52:00.991 INFO   Retrieved output from terraform
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d aws/dev/vpc
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://ip-172-31-17-75:4141/lock?id=ahmedbadawy4%252Fterraform-infrastructure%252Faws%252Fdev%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d aws/dev/vpc
  ```
Plan: 19 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```